---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.InaccurateFailures.InaccurateSketchLine
source: html/e39b590d-0d3f-f163-7727-ad5d50a1831d.htm
---
# Autodesk.Revit.DB.BuiltInFailures.InaccurateFailures.InaccurateSketchLine Property

Line in Sketch is slightly off axis and may cause inaccuracies.

## Syntax (C#)
```csharp
public static FailureDefinitionId InaccurateSketchLine { get; }
```